import os

BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3025006144_gos"
SITE_URL = "https://kaspiy-ast.ru"
FORM_URL = "https://тест/обращение"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал "
    "ГАУ АО «РЦСП «Каспий».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот ГАУ АО «РЦСП «Каспий»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "Региональный центр спортивной подготовки «Каспий» в Астрахани\n"
    "представляет собой выдающееся учреждение, которое с момента своего\n"
    "создания в 2013 году стремился к развитию и популяризации гребного спорта в России.\n"
    "Основанный при поддержке Губернатора Астраханской области, клуб был задуман как\n"
    "площадка для подготовки спортсменов высшего мастерства, направленная на \n"
    "укрепление позиций отечественного гребного спорта на международной арене. \n"
)

TEXT_ADDRESSES = (
    "📍 **Адреса учреждения:**\n"
    "• Основной адрес: г. Астрахань,ул. Красная Набережная, 168\n"
    "• ФОК: г. Астрахань, ул. Джона Рида, 43\n\n"
)

TEXT_PAID_SERVICES = (
    "💳 **Платные услуги**\n\n"
    "Здесь описаны платные услуги центра. Подробнее — на официальном сайте."
)

TEXT_ABOUT_FOK = (
    "🏋️ **Про ФОК**\n\n"
    "Модульное спортивное сооружение создано в рамках программных мероприятий"
    "Модульное спортивное сооружение создано в рамках\n"
    "программных мероприятий федерального проекта «Бизнес-спринт»\n"
    "(«Я выбираю спорт»).\n"
    "Модульный спортивный зал предназачен для тренировок\n"
    "и соревнований любительских команд по видем спорта мини-футбол,\n"
    "гандбол, баскетбол и гимнастика."
    "федерального проекта «Бизнес-спринт» («Я выбираю спорт»).\n\n"
)

TEXT_CONTACTS = (
    "📞 **Справочная информация**\n\n"
    "• Телефон: +7 (8512) 26-68-58\n"
    "• Email: info@kaspiy.astrobl.ru\n"
    "• Режим работы: пн–вс, 7:00–22:00"
)

TEXT_SUPPORT_MENU = (
    "🛡️ **Меры поддержки СВО и членам их семей**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "volleyball": (
        "🏐 **Волейбол сидя**\n\n"
        "Для ветеранов и участников СВО\n"
        "Среда 18:00-20:00\n"
        "Пятница 18:00-20:00\n"
        "Воскресенье 18:00-20:00\n"
        "📍ФОК ГАУ АО «РЦСП «Каспий»\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "backgammon": (
        "🎲 **Нарды без границ**\n\n"
        "Для ветеранов и участников СВО\n"
        "Среда 18:00-20:00\n"
        "Пятница 18:00-20:00\n"
        "Воскресенье 18:00-20:00\n"
        "📍ФОК ГАУ АО "РЦСП "Каспий\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "fitness": (
        "🧘 **Мягкий фитнес**\n\n"
        "Для семей участников СВО\n"
        "(для жен, матерей и детей героев СВО)\n"
        "Понедельник 18:00-19:00\n"
        "Среда 18:00-19:00\n"
        "Пятница 18:00-19:00\n"
        "📍ФОК ГАУ АО "РЦСП "Каспий\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "table_tennis": (
        "🏓 **Настольный теннис**\n\n"
        "Для ветеранов и участников СВО\n"
        "Среда 18:00-20:00\n"
        "Пятница 18:00-20:00\n"
        "Воскресенье 18:00-20:00\n"
        "📍ФОК ГАУ АО "РЦСП "Каспий\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "knife_throwing": (
        "🎯 **Метание ножей**\n\n"
        "Для ветеранов и участников СВО\n"
        "Вторник 10:00-12:00\n"
        "Четверг 16:00-18:00\n"
        "Воскресенье 15:00-17:00\n"
        "📍ГАУ АО «РЦСП «Каспий»\n"
        "г. Астрахань,ул. Красная Набережная, 168"
        "Все подробности по телефону: +79033476746"
    ),
}
